Revit 2024 API
PanelScheduleView.GetPanel Method
 Gets the panel for this view
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId GetPanel()
Visual Basic
Public Function GetPanel As ElementId
Visual C++
public:
ElementId^ GetPanel()
Return Value
 The id of the panel for this view
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace